#+title: PMI
#+author: Jonatan Pilak

* DONE PoC - SFTP: kick-off                                             :mtg:
   SCHEDULED: <2024-06-13 Thu>
:LOGBOOK:
CLOCK: [2024-06-13 Thu 15:00]--[2024-06-13 Thu 15:30] => 0:30
:END:
* DONE [TGK SFTP POC] org                                               :mtg:
   SCHEDULED: <2024-06-14 Fri>
:LOGBOOK:
CLOCK: [2024-06-14 Fri 11:15]--[2024-06-14 Fri 12:15] => 1:00
:END:
* TODO Setting up pmi ms account                                       :task:
   :LOGBOOK:
   CLOCK: [2024-07-08 Mon 15:43]--[2024-07-08 Mon 16:16] =>  0:33
   CLOCK: [2024-06-17 Mon 14:53]--[2024-06-17 Mon 16:29] => 1:36
   CLOCK: [2024-06-13 Thu 18:00]--[2024-06-13 Thu 18:41] => 0:41
   CLOCK: [2024-06-14 Fri 09:00]--[2024-06-14 Fri 09:45] => 0:45
   CLOCK: [2024-06-14 Fri 15:00]--[2024-06-14 Fri 16:45] => 1:45
   :END:
   - [x] Login
   - [x] set MFA
   - [x] check if all works: jira,bb,conflu,deep,aws,tf
   - [-] fight with not working teams
   - [x] setup aws cli
   - [-] terraform

* DONE [TGK SFTP POC] catch-up                                          :mtg:
SCHEDULED: <2024-06-17 Mon>
:LOGBOOK:
CLOCK: [2024-06-17 Mon 15:00]--[2024-06-17 Mon 15:17] =>  0:05
:END:

* DONE Recreate AWS resources manually                                 :task:
   :LOGBOOK:
   CLOCK: [2024-06-17 Mon 20:36]--[2024-06-17 Mon 22:00] =>  1:24
   :END:

* DONE PBF-9917	CloudWatch Dashboard                                   :task:
:LOGBOOK:
CLOCK: [2024-07-13 Sat 21:41]--[2024-07-13 Sat 23:02] => 1:21
CLOCK: [2024-07-10 Wed 21:19]--[2024-07-10 Wed 23:30] =>  2:11
CLOCK: [2024-06-19 Wed 20:26]--[2024-06-19 Wed 22:23] =>  1:57
CLOCK: [2024-06-19 Wed 09:58]--[2024-06-19 Wed 10:43] =>  0:45
CLOCK: [2024-06-19 Wed 08:50]--[2024-06-19 Wed 09:30] =>  0:40
CLOCK: [2024-06-18 Tue 09:58]--[2024-06-18 Tue 11:48] =>  1:50
:END:

* DONE PBF-9920 Transfer Family service configuration                  :task:
:LOGBOOK:
CLOCK: [2024-06-21 Fri 14:14]--[2024-06-21 Fri 15:00] =>  0:46
CLOCK: [2024-06-21 Fri 09:07]--[2024-06-21 Fri 09:20] =>  0:13
CLOCK: [2024-06-20 Thu 20:30]--[2024-06-20 Thu 22:53] =>  2:23
CLOCK: [2024-06-18 Tue 11:48]--[2024-06-18 Tue 13:07] =>  1:19
:END:

* DONE [TGK SFTP POC] Monitoring & Transfer Family                      :mtg:
SCHEDULED: <2024-06-19 Wed>
:LOGBOOK:
CLOCK: [2024-06-19 Wed 09:30]--[2024-06-19 Wed 09:51] =>  0:21
:END:

* DONE [TGK SFTP POC] Monitoring & Transfer Family: follow-up           :mtg:
SCHEDULED: <2024-06-20 Thu>
:LOGBOOK:
CLOCK: [2024-06-21 Fri 16:35]--[2024-06-21 Fri 16:56] =>  0:21
CLOCK: [2024-06-21 Fri 09:20]--[2024-06-21 Fri 10:12] =>  0:52
CLOCK: [2024-06-20 Thu 09:30]--[2024-06-20 Thu 10:43] =>  1:13
:END:

* TODO Architecture design                                             :task:
:LOGBOOK:
CLOCK: [2024-07-08 Mon 21:51]--[2024-07-08 Mon 23:10] =>  1:19
:END:

* DONE [TGK SFTP POC] Backlog refinement & prioritization               :mtg:
SCHEDULED: <2024-07-09 Tue>
:LOGBOOK:
CLOCK: [2024-07-10 Wed 09:15]--[2024-07-10 Wed 09:42] =>  0:27
:END:

* DONE [TGK SFTP POC] API GW/ Home Dir                                  :mtg:
SCHEDULED: <2024-07-10 Wed>
:LOGBOOK:
CLOCK: [2024-07-10 Wed 15:04]--[2024-07-10 Wed 15:35] =>  0:31
:END:

* DONE [TGK SFTP POC] AWS service cost - OB25 & Dashboard
Scheduled: <2024-07-12 Fri>
:LOGBOOK:
CLOCK: [2024-07-12 Fri 12:00]--[2024-07-12 Fri 13:17] =>  1:17
:END:

* DONE Migrate to different bucket                                     :task:
:LOGBOOK:
CLOCK: [2024-07-15 Mon 11:19]--[2024-07-15 Mon 11:37] =>  0:18
CLOCK: [2024-07-12 Fri 17:01]--[2024-07-12 Fri 17:35] =>  0:34
:END:
* TODO Pricing estimation                                              :task:
:LOGBOOK:
CLOCK: [2024-07-11 Thu 15:02]--[2024-07-11 Thu 15:53] =>  0:51
:END:
* TODO PBF-10014 IAM custom policy & IAM custom roles                  :task:
* DONE [TGK SFTP POC] AWS service cost - OB25 / Dashboard /IAM          :mtg:
SCHEDULED: <2024-07-15 Mon>
:LOGBOOK:
CLOCK: [2024-07-15 Mon 13:05]--[2024-07-15 Mon 13:42] =>  0:37
:END:
* TODO Save cloudwatch results                                         :task:
* TODO [TGK SFTP POC] AWS service cost - OB25 / Dashboard /IAM          :mtg:
SCHEDULED: <2024-07-16 Tue>
* TODO Fix role permission                                             :task:
* Reporting                                                          :report:
** Last week
#+BEGIN: clocktable :step day :tstart "<-1w>" :tend "<now>" :compact t
#+END:
** This week
#+BEGIN: clocktable :step day :block thisweek :compact t
#+END:
